Catalogs/ТипыПлатежейФЗ275.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Catalog>
		<Properties>
			<Name>ТипыПлатежейФЗ275</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОписаниеПунктаЗакона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПунктаЗакона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеТребуютсяДокументыПодтвержденияИсполненияКонтракта</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПодтверждающиеДокументы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидДокумента</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыДокументов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ТипыПлатежейФЗ275/Ext/ManagerModule.bsl
Процедура ЗаполнитьПредопределенныеЭлементы() Экспорт
	МакетПоставляемыеДанные = Справочники.ТипыПлатежейФЗ275.ПолучитьМакет("ПоставляемыеДанные").ПолучитьТекст();
	ТаблицаПоставляемыхДанных = ОбщегоНазначения.ПрочитатьXMLВТаблицу(МакетПоставляемыеДанные).Данные;
	
	Для Каждого СтрокаПоставляемыхДанных Из ТаблицаПоставляемыхДанных Цикл 
		ЭлементОбъект = Справочники.ТипыПлатежейФЗ275[СтрокаПоставляемыхДанных.Имя].ПолучитьОбъект();
		
		ЭлементОбъект.ПодтверждающиеДокументы.Очистить();
		
		ЭлементОбъект.ОписаниеПунктаЗакона = СтрокаПоставляемыхДанных.ОписаниеПунктаЗакона;
		ЭлементОбъект.НомерПунктаЗакона = СтрокаПоставляемыхДанных.НомерПунктаЗакона;
		ЭлементОбъект.НеТребуютсяДокументыПодтвержденияИсполненияКонтракта = Булево(СтрокаПоставляемыхДанных.НеТребуетсяДокументПодтверждающийИсполнениеРабот);
		
		// Добавим в табличную часть обязательные виды документов
		ДобавитьВидДокумента(ЭлементОбъект, Справочники.ВидыДокументов.Контракт, Булево(СтрокаПоставляемыхДанных.ТребуетсяКонтракт));
		ДобавитьВидДокумента(ЭлементОбъект, Справочники.ВидыДокументов.КредитныйДоговор, Булево(СтрокаПоставляемыхДанных.ТребуетсяКредитныйДоговор));
		ДобавитьВидДокумента(ЭлементОбъект, Справочники.ВидыДокументов.ДепозитныйДоговор, Булево(СтрокаПоставляемыхДанных.ТребуетсяДепозитныйДоговор));
		
		СортироватьПоКодуВидаДокумента(ЭлементОбъект);
		
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(ЭлементОбъект);
	КонецЦикла;

КонецПроцедуры

Процедура ДобавитьВидДокумента(Объект, ВидДокумента, ТребуетсяДобавление)
	Если ТребуетсяДобавление Тогда
		Если Объект.ПодтверждающиеДокументы.Найти(ВидДокумента , "ВидДокумента") = Неопределено Тогда
			НовыйОбязательныйДокумент = Объект.ПодтверждающиеДокументы.Добавить();
			НовыйОбязательныйДокумент.ВидДокумента = ВидДокумента;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Процедура СортироватьПоКодуВидаДокумента(Объект)
	ВременнаяТаблица = Объект.ПодтверждающиеДокументы.Выгрузить();
	ВременнаяТаблица.Колонки.Добавить("Код");
	
	Для Каждого СтрокаТаблицы Из ВременнаяТаблица Цикл 
		СтрокаТаблицы.Код = СтрокаТаблицы.ВидДокумента.Код;
	КонецЦикла;
	
	ВременнаяТаблица.Сортировать("Код");
	
	Объект.ПодтверждающиеДокументы.Загрузить(ВременнаяТаблица);
КонецПроцедуры

Функция ПодтверждающиеВидыДокументов(Ссылка) Экспорт
	ПодтверждающиеДокументыТипПлатежа = Новый Массив;
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ТипыПлатежейФЗ275ПодтверждающиеДокументы.ВидДокумента КАК ВидДокумента
	|ИЗ
	|	Справочник.ТипыПлатежейФЗ275.ПодтверждающиеДокументы КАК ТипыПлатежейФЗ275ПодтверждающиеДокументы
	|ГДЕ
	|	ТипыПлатежейФЗ275ПодтверждающиеДокументы.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ВидДокумента");
КонецФункции
